// //1-Сума двох чисел: Запросіть у користувача введення двох чисел, додайте їх та виведіть результат.

const number = prompt('введіть число #1')
const number2 = prompt('введіть число #2')

let sum = number + number2
console.log(`Сума двох чисел дорівнює ${sum}`)

// 2-Обчислення площі прямокутника: Запитайте у користувача довжину та ширину прямокутника, а потім обчисліть та виведіть площу прямокутника.

const length = prompt('введіть довжину прямокутника')
const width = prompt('введіть ширину прямокутника')

let square = length * width
console.log(`площа трикутника дорівнює ${square}`)

// 3-Оцінка вартості доставки: Користувач вводить відстань до місця доставки та бажаний час доставки. Програма повинна розрахувати вартість доставки, враховуючи стандартну ставку за км та можливі додаткові тарифи за терміновість доставки.

const distance = prompt('введіть відстань до місця доставки в км')
const time = prompt('введіть бажаний час доставки')
const tariff = 2

if(time <=2){
    tariff1 = 25
}
else if(time <=4){
    tariff1 = 15
}  
else if(time <=6){
    tariff1 = 5
}
let money = (distance * tariff) + tariff1
console.log(`доставка буде коштувати ${money}`)

